list_seasons = [12, 'зима', 1, 'зима', 2, 'зима', 3, 'весна', 4, 'весна', 5, 'весна', 6, 'лето', 7, 'лето', 8, 'лето', 9, 'осень', 10, 'осень', 11, 'осень']
user_month = input("Введите цифру месяца от 1 до 12\n>>>")
print(list_seasons.pop(list_seasons.index(int(user_month))+1))

dict_seasons = {12: 'зима', 1: 'зима', 2: 'зима', 3: 'весна', 4: 'весна', 5: 'весна', 6: 'лето', 7: 'лето', 8: 'лето', 9: 'осень', 10: 'осень', 11: 'осень'}
user_month = input("Введите цифру месяца от 1 до 12\n>>>")
print(dict_seasons.get(int(user_month)))